################################################################################
####       Чтобы сделать json на astra в TerminalFly запустить
####       python3.5 /ivk-ng-next/test/makeJSON.py
################################################################################
####        - Шифры ТМИ в _di и в БД, должны быть одинаковые
####        - первый ключ в словаре dictUV - наименование ОУ
####        - наименование ОУ в dictUV x=?????, должно совпадать с наименованием
####          словарй по форме x_uv, x_di, x_msg                            
################################################################################ 
import json, sys
sys.path.insert(1, 'F:\\ProjIVKNG\\ver-class2002_classes_20_2\\Win')
from test.format_dict import format_main

# Путь куда будет сохранен файл
File_Path = r'F:\ProjIVKNG\ver-class2002_classes_20_2\Win\for_RLCIV\mkaUVDI.json'

# Словарь выводимых сообщений
# key: [    text,               'pause'/int/None ]
KPT_msg = {
'm1':	['Есть питание', 0],
'm2':	['Нет питания', 0],
}
# Словарь телеметрии
# key: [    Название	            valOn	    valOff	    УВ_ДИ_Уставки       ДИ[байт,бит]     Описание]
KPT_di = {
'0':		['04.02.beKKEA11',	     0,	         1,	        [0xE082, 0xE084],   None,	    'хз че за ДИ мб ФКП РЛЦИ'],
'1':		['04.01.beBAEA11',	     0,	         1,	        None,               None,	    'хз че за ДИ мб ФКП РЛЦИ'],
'2':		['04.02.VKKEA11',	     0,	         1,	        None,               None,	    'хз че за ДИ мб КСП РЛЦИ'],
'3':		['04.02.CKKEA12',	     0,	         1,	        None,               None,	    'хз че за ДИ мб КСП РЛЦИ'],
}
# Словарь с параметрами УВ
# key: [    ОписаниеУв	           Увhex            tТМИ    twait   key_msg    rv_uv   AsciiHEx()  di_list_warn     exec_tmi]
KPT_uv = {
'217':		['КПТ Запит. ЭА331 осн',	0x40D9,     1,	    0,	    None,	   None,	 None,      None,           '[{@0}{@2}==on]'],
'417':		['КПТ Запит. ЭА331 рез',	0x41A1,     1,	    0,	    None,	   None,	 None,      None,           '[{@0}{@2}==on]'],
'1017':		['КПТ Снять пит. ЭА331',    0x43F9,     1,	    0,	    None,	   None,	 None,      None,           '[{@0}{@2}==off]'],
'219':		['КПТ Запит. ЭА332 осн',	0x40D8,     1,	    0,	    None,	   None,	 None,      None,           '[{@1}{@2}==on]'],
'419':		['КПТ Запит. ЭА332 рез',	0x41A3,     1,	    0,	    None,	   None,	 None,      None,           '[{@1}{@2}==on]'],
'1019':		['КПТ Снять пит. ЭА332',    0x43FB,     1,	    0,	    None,	   None,	 None,      None,           '[{@1}{@2}==on]'],
}

# Словарь выводимых сообщений
# key: [    text,               'pause'/int/None ]
RLCIV_msg = {
'm1':	['Подать 27В на РЛЦИ-В', 1],
'm2':	['Установить режим "Иммитатор ЦА-О"', 1],
'm3':	['Начать работу с БА-О', 1],
'm4':	['Остановить работу с БА-О', 1],
'm5':	['Отключить имитатор ЦА (Снять "галочку" с "ЦА-О" и нажать кнопку "Установить режим"', 1],
'm6':	['Установить режим «Имитатор ЦА-Р»', 1],
'm7':	['Начать работу с БА-Р»', 1],
'm8':	['Остановить работу с БА-Р»', 1],
'k1':	['ВИЗ КОНТРОЛЬ НА СПР (данные)', 1],
'k2':	['КОНТРОЛЬ ПОТРЕБ МОЩН', 1],
'k3':	['КОНТРОЛЬ МОЩН ВЧ-СИГНАЛА', 1],
'k4':	['Регистрация Запись файла', 1],
'k5':	['Подождать 12 ± 2 мин. Время контролировать в окне «Время работы УМ» в программе «ФКИП-ИС-В»»', 1]
}

# Словарь телеметрии
# key: [    Название	                    valOn	        valOff	        УВнаДИУставки   ДИ(байт,бит)     Описание]
RLCIV_di = {                                                                                                                                                                                                
	#Телеметрия БА (ЭА332)                                                                                                                                                                              
'1':		['10.01.FIP1',	                0,	            1,                None,         '6, 9',		    'Вкл ФИП-О'],
'2':		['10.01.FIP2',	                0,	            1,	              None,         '6, 8',		    'Вкл ФИП-Р'],
'3':		['10.01.MOD1',	                0,	            1,	              None,         '6, 11',	    'Вкл МОД-О'],
'4':		['10.01.MOD2',	                0,	            1,	              None,         '6, 10',	    'Вкл МОД-Р'],
'5':		['10.01.PCH1',	                0,	            1,	              None,         '6, 13',	    'Вкл ПЧ-О'],
'6':		['10.01.PCH2',	                0,	            1,	              None,         '6, 12',	    'Вкл ПЧ-Р'],
'7':		['10.01.UM1',	                0,	            1,	              None,         '6, 15',	    'Вкл УМ-О'],
'8':		['10.01.UM2',	                0,	            1,	              None,         '6, 14',	    'Вкл УМ-Р'],
'9':		['10.01.BA_TEMP_CARD',	        [-55, 125],	    None,	          None,         '26,15-8',		'Т1 БА (плата)' ],
'10':		['10.01.BA_TEMP_CONTR',	        [-55, 125],	    None,	          None,         '26, 7-0',		'Т2 БА (контр)'],
'11':		['10.01.ETALON1',	            47,	            None,	          None,         '22, 15-8',		'Эталон R1'],
'12':		['10.01.ETALON2',	            74.1,	        None,	          None,         '22, 7-0',		'Эталон R2'],
'13':		['10.01.SEC',	                'out',	        None,	          None,         '9-11, 15-10',  '9й байт используется БШВ'],
'14':		['10.01.NUMB_LAST_UV',	        [0, 27],	    None,	          None,         '31, 7-0',		'Код команды'],
'15':		['10.01.FRAME_COUNTER',	        [0, 255],	    None,	          None,         '32, 15-8',		'Номер кадра ДИ'],
	#Телеметрия ФИП (ЭА330)                                                                                                                                                                             
'16':		['10.01.FIP1_KD1_BS',	        0,	            1,	              None,         '20, 0',	    'Питание Б/с ФИП-О'],
'17':		['10.01.FIP2_KD2_BS',	        0,	            1,	              None,         '20, 1',	    'Питание Б/с ФИП-О'],
'18':		['10.01.FIP1_ATM13_POW',	    [1.5, 3],	    [0, 0.6],         None,         '18, 15-8',		'Пит ФИП-О'],
'19':		['10.01.FIP2_ATM14_POW ',	    [1.5, 3],	    [0, 0.6],         None,         '18, 7-0',		'Пит ФИП-Р'],
'20':		['10.01.FIP_INFO',	            1,	            0,	              None,         '30, 15',	    'Режим "Имитатор ФИП"'],
'21':		['10.01.MOD1_STAT_CONNECT',	    0,	            1,	              None,         '30, 9',	    'Связь с МОД-О'],
'22':		['10.01.MOD2_STAT_CONNECT',	    0,	            1,	              None,         '30, 8',	    'Связь с МОД-Р'],
'23':		['10.01.BSK1_STAT_CONNECT',	    0,	            1,	              None,         '30, 11',	    'Связь с ЦА-О'],
'24':		['10.01.BSK2_STAT_CONNECT',	    0,	            1,	              None,         '30, 10',	    'Связь с ЦА-Р'],
'25':		['10.01.BSK_STAT_INF',	        0,	            1,	              None,         '30, 12',	    'Данные от ЦА'],
'26':		['10.01.FIP_STAT_VOLT_PLL1',    0,	            1,	              None,         '30, 14',	    'Напряжение или Частота Наличие частоты PLL1'],
'27':		['10.01.FIP_STAT_VOLT_PLL2',    0,	            1,	              None,         '30, 13',	    'Наличие частоты PLL2'],
'28':		['10.01.FIP_TEMP_IP',	        [-55, 125],	    None,	          None,         '30, 7-0',		'Температура ИП работающего комплекта ФИП'],
'29':		['10.01.FIP_TEMP_PLIS',	        [-55, 125],	    None,	          None,         '31, 15-8',		'Температура ПЛИС работающего комплекта ФИП'],
	#Телеметрия МОД (ЭА331)                                                                                                                                                                                                                                                                 
'30':		['10.01.MOD1_KD3_BS',	        0,	            1,	              None,         '20, 2',	    'Наличие питания б/с в   МОД-О'],
'31':		['10.01.MOD2_KD4_BS',	        0,	            1,	              None,         '20, 3',	    'Наличие питания б/с в  МОД-Р'],
'32':		['10.01.MOD1_ATM15_POW',	    [3, 5],	        [0, 0.6],	      None,         '19, 15-8',		'Контроль напряжения вторичного питания МОД-О'],
'33':		['10.01.MOD2_ATM16_POW',	    [3, 5],	        [0, 0.6],	      None,         '19, 7-0',		'Контроль напряжения вторичного питания МОД-Р'],
'34':		['10.01.MOD_INFO',	            1,	            0,	              None,         '28, 13',	    'Режим "Имитатор МОД"'],
'35':		['10.01.MODE_M',	            [0, 4],	        None,	          None,         '28, 15-14',    'Режим работы модулятора'],
'36':		['10.01.FIP1_STAT_CONNECT',	    0,	            1,	              None,         '28, 9',	    'Есть ли связь с ФИП-О у работающего комплекта МОД'],
'37':		['10.01.FIP2_STAT_CONNECT',	    0,	            1,	              None,         '28, 8',	    'Есть ли связь с ФИП-Р у работающего комплекта МОД'],
'38':		['10.01.FIP_STAT_INF',	        0,	            1,	              None,         '28, 10',	    'Наличие данных от ФИП'],
'39':		['10.01.MOD_STAT_FREQ_PLL',	    0,	            1,	              None,         '28, 12',	    'Наличие частоты PLL'],
'40':		['10.01.MOD_TEMP_PMOD',	        [-55, 125],	    None,	          None,         '28, 7-0',		'Температура платы работающего комплекта МОД'],
'41':		['10.01.MOD_TEMP_PLIS',	        [0, 125],	    None,	          None,         '29, 15-8',		'Температура ПЛИС работающего комплекта МОД'],
'42':		['10.01.MOD1_SIT1',	            [47, 74],	    None,	          None,         '23, 15-8',		'Датчик системы измерения температуры (СИТ) внутри МОД-О'],
'43':		['10.01.MOD2_SIT5',	            [47, 74],	    None,	          None,         '25, 15-8',		'Датчик СИТ внутри МОД-Р'],
	#Телеметрия ПЧ (ЭА331)                                                                                                                                                  
'44':		['10.01.PCH1_KD12_BS',	        0,	            1,	              None,         '20, 11',	    'Наличие питания в ПЧ-О'],
'45':		['10.01.PCH2_KD14_BS',	        0,	            1,	              None,         '20, 13',	    'Наличие питания в ПЧ-Р'],
'46':		['10.01.PCH1_KD5_P_SYNT',	    0,	            1,	              None,         '20, 4',	    'Наличие мощности синтезатора ПЧ-О'],
'47':		['10.01.PCH2_KD6_P_SYNT',	    0,	            1,	              None,         '20, 5',	    'Наличие мощности синтезатора ПЧ-Р'],
'48':		['10.01.PCH1_KD19_F_SYNT',	    0,	            1,	              None,         '21, 2',	    'Наличие нужной частоты синтезатора ПЧ-О'],
'49':		['10.01.PCH2_KD20_F_SYNT',	    0,	            1,	              None,         '21, 3',	    'Наличие нужной частоты синтезатора ПЧ-Р'],
'50':		['10.01.PCH1_KD21_P_VH',	    0,	            1,	              None,         '21, 4',	    'Наличие мощности на входе ПЧ-О'],
'51':		['10.01.PCH2_KD22_P_VH',	    0,	            1,	              None,         '21, 5',	    'Наличие мощности на входе ПЧ-Р'],
'52':		['10.01.PCH1_KD7_P_VN',	        0,	            1,	              None,         '20, 6',	    'Наличие мощности внутри ПЧ-О'],
'53':		['10.01.PCH2_KD8_P_VN',	        0,	            1,	              None,         '20, 7',	    'Наличие мощности внутри ПЧ-Р'],
'54':		['10.01.PCH1_KD23_F_VIH',	    0,	            1,	              None,         '21, 6',	    'Наличие частоты на выходе ПЧ-О'],
'55':		['10.01.PCH2_KD24_F_VIH',	    0,	            1,	              None,         '21, 7',	    'Наличие частоты на выходе ПЧ-Р'],
	#Телеметрия УМ (ЭА331)                                                                                                                                                 
'56':		['10.01.UM1_KD11_BS',	        0,	            1,	              None,         '20, 10',	    'Наличие питания в УМ-О'],
'57':		['10.01.UM2_KD13_BS',	        0,	            1,	              None,         '20, 12',	    'Наличие питания в УМ-Р'],
'58':		['10.01.UM1_KD9_P',	            0,	            1,	              None,         '20, 8',	    'Наличие мощности внутри УМ-О'],
'59':		['10.01.UM2_KD10_P',	        0,	            1,	              None,         '20, 9',	    'Наличие мощности внутри УМ-Р'],
'60':		['10.01.UM1_ATM1_P_OUT',	    [1, 2.5],	    [0, 0.3],	      None,         '12, 15-8',	 	'Уровень выходной мощности УМ-О'],
'61':		['10.01.UM2_ATM2_P_OUT',	    [1, 2.5],	    [0, 0.3],	      None,         '12, 7-0',	 	'Уровень выходной мощности УМ-Р'],
'62':		['10.01.KONV_SIT6',	            [78.7, 121.3],	None,	          None,         '25, 7-0',	 	'Датчик СИТ внутри конвертера передатчика'],
	#Телеметрия антенны                                                                                                                                                                                                                 
'63':		['10.01.AFU_END_NP_OX',	        0,	            1,	              None,         '6, 7',	        'Антенна была в начальном положении (НП) по оси X (датчик начального положения (ДНП X) срабатывал)'],
'64':		['10.01.AFU_END_NP_OZ',	        0,	            1,	              None,         '6, 6',	        'Антенна была в начальном положении по оси Z (ДНП Z срабатывал)'],
'65':		['10.01.AFU_STAT_DNP_OX',	    0,	            1,	              None,         '7, 14',	    'Антенна в начальном положении по оси X'],
'66':		['10.01.AFU_STAT_DKP_OX',	    0,	            1,	              None,         '7, 15',	    'Антенна в конечном положении по оси X'],
'67':		['10.01.AFU_SEND_IMPULSE_OX',   [0, 16383],	    None,	          None,         '7, 13-0',	  	'Отклонение от НП по оси X в шагах двигателя'],
'68':		['10.01.AFU_STAT_DNP_OZ',	    0,	            1,	              None,         '8, 14',	    'Антенна в начальном положении по оси Z'],
'69':		['10.01.AFU_STAT_DKP_OZ',	    'Включено',	    'Выключено',	  None,         '8, 15',	    'Антенна в конечном положении по оси Z'],
'70':		['10.01.AFU_SEND_IMPULSE_OZ',   {'0':[0, 16383],                                                               
                                            '1':'out'},     None,	          None,              '8,                 13-0',	  	'Отклонение от НП по оси Z в шагах двигателя'],
}

# Словарь с параметрами УВ
# key: [    ОписаниеУв	                УВвhex    tТМИ  twait   key_msg['m1', 'm2'] rv_uv  AsciiHEx()  di_list_warn   exec_tmi]
RLCIV_uv = {              
'0':		['РЛЦИВ Вкл ПЧ-О',	        None,       1,	    0,	    None,	        None,	 None,      None,       '[{@5}{@44}{@46}{@48}{@52}{@54}==on]'],
'1':		['РЛЦИВ Вкл ПЧ-Р',	        None,       1,	    0,	    None,	        None,	 None,      None,       '[{@6}{@45}{@47}{@49}{@53}{@55}==on]'],
'2':		['РЛЦИВ ОТКЛ ПЧ',	        None,       1,	    0,	    None,	        None,	 None,      None,       '[{@5}{@44}{@46}{@48}{@52}{@54}==off] & [{@6}{@45}{@47}{@49}{@53}{@55}==off]'],
'3':		['РЛЦИВ Вкл ФИП-О',	        None,       1,	    0,	    None,	        [5,3],	 None,      ['10.01.UM2','10.01.MOD1.Н'],       '[{@1}{@16}{@18}==on] & [{@20}{@23}{@26}{@27}{@28}{@29}==on]'],
'4':		['РЛЦИВ Вкл ФИП-Р',	        None,       1,	    0,	    None,	        None,	 None,      None,       '[{@2}{@17}{@19}==on] & [{@20}{@23}{@26}{@27}{@28}{@29}==on]'],
'5':		['РЛЦИВ ОТКЛ ФИП',	        None,       1,	    0,	    None,	        None,	 None,      None,       '[{@1}{@16}{@18}==off] & [{@2}{@17}{@19}==off] & [{@20}{@23}{@26}{@27}{@28}{@29}==off]'],
'6':		['РЛЦИВ Вкл МОД-О',	        None,       1,	    0,	    None,	        None,	 None,      None,       '[{@3}{@21}{@30}{@32}==on] & [{@44}{@50}==on] & [{@34}{@35}{@36}{@39}{@40}==on]'],
'7':		['РЛЦИВ Вкл МОД-Р',	        None,       1,	    0,	    None,	        None,	 None,      None,       '[{@4}{@22}{@31}{@33}==on] & [{@45}{@51}==on] & [{@34}{@35}{@37}{@39}{@40}==on]'],
'8':		['РЛЦИВ ОТКЛ МОД',	        None,       1,	    0,	    None,	        None,	 None,      None,       '[{@3}{@21}{@30}{@32}==off] & [{@44}{@50}==off] & [{@4}{@22}{@31}{@33}==off] & [{@45}{@51}==off] & [{@34}{@35}{@37}{@39}{@40}==off]'],
'9':		['РЛЦИВ Вкл УМ-О',	        None,       1,	    0,	    None,	        None,	 None,      None,       '[{@7}{@56}{@58}{@60}==on]'],
'10':		['РЛЦИВ Вкл УМ-Р',	        None,       1,	    0,	    None,           None,	 None,      None,       '[{@8}{@57}{@59}{@61}==on]'],
'11':		['РЛЦИВ ОТКЛ УМ',	        0x500B,     1,	    0,	    None,	        None,	 None,      None,       '[{@7}{@56}{@58}{@60}==off] & [{@8}{@57}{@59}{@61}==off]'],
'12':		['РЛЦИВ ВКЛ ИМ-ФИП',	    0x500C,     1,	    0,	    None,	        None,	 None,      None,       '[{@20}{@25}==on]'],
'13':		['РЛЦИВ ОТКЛ ИМ-ФИП',	    0x500D,     1,	    0,	    None,	        None,	 None,      None,       '[{@20}{@25}==off]'],
'14':		['РЛЦИВ УСТ РЕЖ М1',	    0x500E,     1,	    0,	    None,	        None,	 None,      None,       '[{@35}==1]'],
'15':		['РЛЦИВ УСТ РЕЖ М2',	    0x500F,     1,	    0,	    None,	        None,	 None,      None,       '[{@35}==2]'],
'16':		['РЛЦИВ УСТ РЕЖ М3',	    0x5010,     1,	    0,	    None,	        None,	 None,      None,       '[{@35}==3]'],
'17':		['РЛЦИВ УСТ РЕЖ М4',	    0x5011,     1,	    0,	    None,	        None,	 None,      None,       '[{@35}==4]'],
'18':		['РЛЦИВ"""  ВКЛ ИМ-МОД',	    0x5012,     1,	    0,	    None,	        None,	 None,      None,       '[{@34}{@38}==on]'],
'19':		['РЛЦИВ ОТКЛ ИМ-МОД',	    0x5013,     1,	    0,	    None,	        None,	 None,      None,       '[{@34}{@38}==off]'],
'20':		['РЛЦИВ ШТАТ RS485',	    0x5014,     1,	    0,	    None,	        None,	 None,      None,       None],
'21':		['РЛЦИВ УСТ  """RS485-О',	    0x5015,     1,	    0,	    None,	        None,	 None,      None,       None],
'22':		['РЛЦИВ УСТ RS485-Р',	    0x5016,     1,	    0,	    None,	        None,	 None,      None,       None],
'23':		['РЛЦИВ ПУСК ШД',	        0x5017,     1,	    0,	    None,	        None,	 None,      None,       None],
'24':		['РЛЦИВ ОСТАН ШД',	        0x5018,     1,	    0,	    None,	        None,	 None,      None,       '[{@67}{@70}==same#1]'],
'25':		['РЛЦИВ УСТ ВР ДВИЖ ШД',	0x5019,     1,	    0,	    None,	        None,	 None,      None,       None],
'26':		['РЛЦИВ УСТ СКОР VS1',	    0x501A,     1,	    0,	    None,	        None,	 None,      None,       None],
'27':		['РЛЦИВ УСТ СКОР VS2',	    0x501B,     1,	    0,	    None,	        None,	 None,      None,       None],
}


##############################################################################################
# Main dcit
dictUV = {
    'clear_buf': 0xE107,
    'KPT': {
        'adress': 4,
        'shift_adress': 11,
        'subadress': 0,
        'shift_subadress': 0,
        'nDI': None,
        },                                                                
    'RLCIV': {
        'adress': 10,
        'shift_adress': 11,
        'subadress': 0,             # Subadress 28 или 0
        'shift_subadress': 0,
        'nDI': 1,
        }
}
dictUV = format_main(globals())
print('Msg:: Dcit formatted sucessfully')

if __name__ == '__main__':
    with open(File_Path, 'w', encoding='utf-8') as file:
        json.dump(dictUV, file, ensure_ascii=False, indent=4)
        print('Msg:: Dcit converted to JSON sucessfully')