################################################################################
####       Чтобы сделать json на astra в TerminalFly запустить
####       python3.5 ~/ivk-ng-next/test/makeJSON.py
####       python3.5 ~/home/administrator/Desktop/РЛЦИ-В/for_RLCIV/mkaUVDI.json
################################################################################
####        - Шифры ТМИ в _di и в БД, должны быть одинаковые
####        - первый ключ в словаре dictUV - наименование ОУ
####        - наименование ОУ в dictUV x=?????, должно совпадать с наименованием
####          словарй по форме x_uv, x_di, x_msg                            
################################################################################ 
import json, sys
sys.path.insert(1, '/home/administrator/ivk-ng-next/test')
from format_dict import format_main
################################################################################ 

# Путь куда будет сохранен файл
File_Path = '/home/administrator/Desktop/РЛЦИ-В/for_RLCIV/mkaUVDI.json'

# Словарь выводимых сообщений
# key: [    text,               'pause'/int/None ]
KPT_msg = {
'm1':	['Есть питание', 0],
'm2':	['Нет питания', 0],
}
# Словарь телеметрии
# key: [    Название	                   ДИ[байт,бит]     valOn	    valOff	      valSign	    Описание]
KPT_di = {
'0':		['04.02.beKKEA11',	          None,	            0,	         1,	          'bit',	    'хз че за ДИ мб ФКП РЛЦИ'],
'1':		['04.01.beBAEA11',	          None,	            0,	         1,	          'bit',	    'хз че за ДИ мб ФКП РЛЦИ'],
'2':		['04.02.VKKEA11',	          None,	            0,	         1,	          'bit',	    'хз че за ДИ мб КСП РЛЦИ'],
'3':		['04.02.CKKEA12',	          None,	            0,	         1,	          'bit',	    'хз че за ДИ мб КСП РЛЦИ'],
}
# Словарь с параметрами УВ
# key: [    ОписаниеУв	            tТМИ  twait  key_msg_['m1', 'm2']       rv_uv  AsciiHEx()   di_list_warn   exec_tmi]
KPT_uv = {
'17':		['Запит. ЭА331',	    1,	    0,	None,	                    None,	 None,      None,     '[{@0}{@2}==on]'],
'117':		['Снять пит. ЭА331',    1,	    0,	None,	                    None,	 None,      None,     '[{@0}{@2}==off]'],
'19':		['Запит. ЭА332',	    1,	    0,	None,	                    None,	 None,      None,     '[{@1}{@2}==on]'],
'119':		['Снять пит. ЭА332',    1,	    0,	None,	                    None,	 None,      None,     '[{@1}{@2}==on]'],
}

# Словарь выводимых сообщений
# key: [    text,               'pause'/int/None ]
RLCIV_msg = {
'm1':	['Подать 27В на РЛЦИ-В', 0],
'm2':	['Установить режим "Иммитатор ЦА-О"', 0],
'm3':	['Начать работу с БА-О', 0],
'm4':	['Остановить работу с БА-О', 0],
'm5':	['Отключить имитатор ЦА (Снять "галочку" с "ЦА-О" и нажать кнопку "Установить режим"', 0],
'm6':	['Установить режим «Имитатор ЦА-Р»', 0],
'm7':	['Начать работу с БА-Р»', 0],
'm8':	['Остановить работу с БА-Р»', 0],
'k1':	['ВИЗ КОНТРОЛЬ НА СПР (данные)', 0],
'k2':	['КОНТРОЛЬ ПОТРЕБ МОЩН', 0],
'k3':	['КОНТРОЛЬ МОЩН ВЧ-СИГНАЛА', 0],
'k4':	['Регистрация Запись файла', 0],
'k5':	['Подождать 12 ± 2 мин. Время контролировать в окне «Время работы УМ» в программе «ФКИП-ИС-В»»', 0]
}

# Словарь телеметрии
# key: [    Название	                   ДИ[байт,бит]     valOn	    valOff	      valSign	    Описание]
RLCIV_di = {
	#Телеметрия БА (ЭА332)
'1':		['10.01.FIP1',	                [6, 9],	        0,	            1,	        'bit',	    'Вкл ФИП-О'],
'2':		['10.01.FIP2',	                [6, 8],	        0,	            1,	        'bit',	    'Вкл ФИП-Р'],
'3':		['10.01.MOD1',	                [6, 11],	    0,	            1,	        'bit',	    'Вкл МОД-О'],
'4':		['10.01.MOD2',	                [6, 10],	    0,	            1,	        'bit',	    'Вкл МОД-Р'],
'5':		['10.01.PCH1',	                [6, 13],	    0,	            1,	        'bit',	    'Вкл ПЧ-О'],
'6':		['10.01.PCH2',	                [6, 12],	    0,	            1,	        'bit',	    'Вкл ПЧ-Р'],
'7':		['10.01.UM1',	                [6, 15],	    0,	            1,	        'bit',	    'Вкл УМ-О'],
'8':		['10.01.UM2',	                [6, 14],	    0,	            1,	        'bit',	    'Вкл УМ-Р'],
'9':		['10.01.BA_TEMP_CARD',	        [26, [15, 8]],	[-55, 125],	    None,	    'analog',	'Т1 БА (плата)' ],
'10':		['10.01.BA_TEMP_CONTR',	        [26, [7, 0]],	[-55, 125],	    None,	    'analog',	'Т2 БА (контр)'],
'11':		['10.01.ETALON1',	            [22, [15, 8]],	47,	            None,	    'analog',	'Эталон R1'],
'12':		['10.01.ETALON2',	            [22, [7, 0]],	74.1,	        None,	    'analog',	'Эталон R2'],
'13':		['10.01.SEC',	                [9, [15,0], 10, [15,0], 11, [15,0]],
                                                            None,	        None,	    None,	    '9й байт используется БШВ'],
'14':		['10.01.NUMB_LAST_UV',	        [31, [7, 0]],	[0, 25],	    None,	    'analog',	'Код команды'],
'15':		['10.01.FRAME_COUNTER',	        [32, [15, 8]],	[0, 255],	    None,	    'analog',	'Номер кадра ДИ'],
	#Телеметрия ФИП (ЭА330)
'16':		['10.01.FIP1_KD1_BS',	        [20, 0],	    0,	            1,	        'bit',	    'Питание Б/с ФИП-О'],
'17':		['10.01.FIP2_KD2_BS',	        [20, 1],	    0,	            1,	        'bit',	    'Питание Б/с ФИП-О'],
'18':		['10.01.FIP1_ATM13_POW',	    [18, [15, 8]],	[1.5, 3],	    [0, 0.6],   'analog',	'Пит ФИП-О'],
'19':		['10.01.FIP2_ATM14_POW ',	    [18, [7, 0]],	[1.5, 3],	    [0, 0.6],   'analog',	'Пит ФИП-Р'],
'20':		['10.01.FIP_INFO',	            [30, 15],	    1,	            0,	        'bit',	    'Режим "Имитатор ФИП"'],
'21':		['10.01.MOD1_STAT_CONNECT',	    [30, 9],	    0,	            1,	        'bit',	    'Связь с МОД-О'],
'22':		['10.01.MOD2_STAT_CONNECT',	    [30, 8],	    0,	            1,	        'bit',	    'Связь с МОД-Р'],
'23':		['10.01.BSK1_STAT_CONNECT',	    [30, 11],	    0,	            1,	        'bit',	    'Связь с ЦА-О'],
'24':		['10.01.BSK2_STAT_CONNECT',	    [30, 10],	    0,	            1,	        'bit',	    'Связь с ЦА-Р'],
'25':		['10.01.BSK_STAT_INF',	        [30, 12],	    0,	            1,	        'bit',	    'Данные от ЦА'],
'26':		['10.01.FIP_STAT_VOLT_PLL1',	[30, 14],	    0,	            1,	        'bit',	    'Напряжение или Частота Наличие частоты PLL1'],
'27':		['10.01.FIP_STAT_VOLT_PLL2',	[30, 13],	    0,	            1,	        'bit',	    'Наличие частоты PLL2'],
'28':		['10.01.FIP_TEMP_IP',	        [30, [7, 0]],	[-55, 125],	    None,	    'analog',	'Температура ИП работающего комплекта ФИП'],
'29':		['10.01.FIP_TEMP_PLIS',	        [31, [15, 8]],	[-55, 125],	    None,	    'analog',	'Температура ПЛИС работающего комплекта ФИП'],
	#Телеметрия МОД (ЭА331)
'30':		['10.01.MOD1_KD3_BS',	        [20, 2],	    0,	            1,	        'bit',	    'Наличие питания б/с в   МОД-О'],
'31':		['10.01.MOD2_KD4_BS',	        [20, 3],	    0,	            1,	        'bit',	    'Наличие питания б/с в  МОД-Р'],
'32':		['10.01.MOD1_ATM15_POW',	    [19, [15, 8]],	[3, 5],	        [0, 0.6],	'analog',	'Контроль напряжения вторичного питания МОД-О'],
'33':		['10.01.MOD2_ATM16_POW',	    [19, [7, 0]],	[3, 5],	        [0, 0.6],	'analog',	'Контроль напряжения вторичного питания МОД-Р'],
'34':		['10.01.MOD_INFO',	            [28, 13],	    1,	            0,	        'bit',	    'Режим "Имитатор МОД"'],
'35':		['10.01.MODE_M',	            [28, [15, 14]],	[0, 4],	        None,	    None,	'Режим работы модулятора'],
'36':		['10.01.FIP1_STAT_CONNECT',	    [28, 9],	    0,	            1,	        'bit',	    'Есть ли связь с ФИП-О у работающего комплекта МОД'],
'37':		['10.01.FIP2_STAT_CONNECT',	    [28, 8],	    0,	            1,	        'bit',	    'Есть ли связь с ФИП-Р у работающего комплекта МОД'],
'38':		['10.01.FIP_STAT_INF',	        [28, 10],	    0,	            1,	        'bit',	    'Наличие данных от ФИП'],
'39':		['10.01.MOD_STAT_FREQ_PLL',	    [28, 12],	    0,	            1,	        'bit',	    'Наличие частоты PLL'],
'40':		['10.01.MOD_TEMP_PMOD',	        [28, [7,0]],	[-55, 125],	    None,	    'analog',	'Температура платы работающего комплекта МОД'],
'41':		['10.01.MOD_TEMP_PLIS',	        [29, [15,8]],	[0, 125],	    None,	    'analog',	'Температура ПЛИС работающего комплекта МОД'],
'42':		['10.01.MOD1_SIT1',	            [23, [15,8]],	[47, 74],	    None,	    'analog',	'Датчик системы измерения температуры (СИТ) внутри МОД-О'],
'43':		['10.01.MOD2_SIT5',	            [25, [15,8]],	[47, 74],	    None,	    'analog',	'Датчик СИТ внутри МОД-Р'],
	#Телеметрия ПЧ (ЭА331)
'44':		['10.01.PCH1_KD12_BS',	        [20, 11],	    0,	            1,	        'bit',	    'Наличие питания в ПЧ-О'],
'45':		['10.01.PCH2_KD14_BS',	        [20, 13],	    0,	            1,	        'bit',	    'Наличие питания в ПЧ-Р'],
'46':		['10.01.PCH1_KD5_P_SYNT',	    [20, 4],	    0,	            1,	        'bit',	    'Наличие мощности синтезатора ПЧ-О'],
'47':		['10.01.PCH2_KD6_P_SYNT',	    [20, 5],	    0,	            1,	        'bit',	    'Наличие мощности синтезатора ПЧ-Р'],
'48':		['10.01.PCH1_KD19_F_SYNT',	    [21, 2],	    0,	            1,	        'bit',	    'Наличие нужной частоты синтезатора ПЧ-О'],
'49':		['10.01.PCH2_KD20_F_SYNT',	    [21, 3],	    0,	            1,	        'bit',	    'Наличие нужной частоты синтезатора ПЧ-Р'],
'50':		['10.01.PCH1_KD21_P_VH',	    [21, 4],	    0,	            1,	        'bit',	    'Наличие мощности на входе ПЧ-О'],
'51':		['10.01.PCH2_KD22_P_VH',	    [21, 5],	    0,	            1,	        'bit',	    'Наличие мощности на входе ПЧ-Р'],
'52':		['10.01.PCH1_KD7_P_VN',	        [20, 6],	    0,	            1,	        'bit',	    'Наличие мощности внутри ПЧ-О'],
'53':		['10.01.PCH2_KD8_P_VN',	        [20, 7],	    0,	            1,	        'bit',	    'Наличие мощности внутри ПЧ-Р'],
'54':		['10.01.PCH1_KD23_F_VIH',	    [21, 6],	    0,	            1,	        'bit',	    'Наличие частоты на выходе ПЧ-О'],
'55':		['10.01.PCH2_KD24_F_VIH',	    [21, 7],	    0,	            1,	        'bit',	    'Наличие частоты на выходе ПЧ-Р'],
	#Телеметрия УМ (ЭА331) 
'56':		['10.01.UM1_KD11_BS',	        [20, 10],	    0,	            1,	        'bit',	    'Наличие питания в УМ-О'],
'57':		['10.01.UM2_KD13_BS',	        [20, 12],	    0,	            1,	        'bit',	    'Наличие питания в УМ-Р'],
'58':		['10.01.UM1_KD9_P',	            [20, 8],	    0,	            1,	        'bit',	    'Наличие мощности внутри УМ-О'],
'59':		['10.01.UM2_KD10_P',	        [20, 9],	    0,	            1,	        'bit',	    'Наличие мощности внутри УМ-Р'],
'60':		['10.01.UM1_ATM1_P_OUT',	    [12, [15, 8]],	[1, 2.5],	    [0, 0.3],	'analog',	'Уровень выходной мощности УМ-О'],
'61':		['10.01.UM2_ATM2_P_OUT',	    [12, [7, 0]],	[1, 2.5],	    [0, 0.3],	'analog',	'Уровень выходной мощности УМ-Р'],
'62':		['10.01.KONV_SIT6',	            [25, [7,0]],	[78.7, 121.3],	None,	    'analog',	'Датчик СИТ внутри конвертера передатчика'],
	#Телеметрия антенны
'63':		['10.01.AFU_END_NP_OX',	        [6, 7],	        0,	            1,	        'bit',	    'Антенна была в начальном положении (НП) по оси X (датчик начального положения (ДНП X) срабатывал)'],
'64':		['10.01.AFU_END_NP_OZ',	        [6, 6],	        0,	            1,	        'bit',	    'Антенна была в начальном положении по оси Z (ДНП Z срабатывал)'],
'65':		['10.01.AFU_STAT_DNP_OX',	    [7, 14],	    0,	            1,	        'bit',	    'Антенна в начальном положении по оси X'],
'66':		['10.01.AFU_STAT_DKP_OX',	    [7, 15],	    0,	            1,	        'bit',	    'Антенна в конечном положении по оси X'],
'67':		['10.01.AFU_SEND_IMPULSE_OX',	[7, [13, 0]],	[0, 16383],	    None,	    'analog',	'Отклонение от НП по оси X в шагах двигателя'],
'68':		['10.01.AFU_STAT_DNP_OZ',	    [8, 14],	    0,	            1,	        'bit',	    'Антенна в начальном положении по оси Z'],
'69':		['10.01.AFU_STAT_DKP_OZ',	    [8, 15],	    0,	            1,	        'bit',	    'Антенна в конечном положении по оси Z'],
'70':		['10.01.AFU_SEND_IMPULSE_OZ',	[8, [13, 0]],	{'0':[0, 16383],'1':[0, 16383]},	    None,	    'analog',	'Отклонение от НП по оси Z в шагах двигателя'],
}

# Словарь с параметрами УВ
# key: [    ОписаниеУв	      tТМИ  twait  key_msg_['m1', 'm2']         rv_uv  AsciiHEx()   di_list_warn   exec_tmi]
RLCIV_uv = {              
'0':		['Вкл ПЧ-О',	    1,	    0,	None,	                    None,	 None,      None,     '[{@5}{@44}{@46}{@48}{@52}{@54}==on]'],
'1':		['Вкл ПЧ-Р',	    1,	    0,	None,	                    None,	 None,      None,     '[{@6}{@45}{@47}{@49}{@53}{@55}==on]'],
'2':		['ОТКЛ ПЧ',	        1,	    0,	None,	                    None,	 None,      None,     '[{@5}{@44}{@46}{@48}{@52}{@54}==off] & [{@6}{@45}{@47}{@49}{@53}{@55}==off]'],
'3':		['Вкл ФИП-О',	    1,	    0,	None,	                    [5,3],	 None,      ['10.01.UM2','10.01.MOD1'],
                                                                                                        '[{@1}{@16}{@18}==on] & [{@20}{@23}{@26}{@27}{@28}{@29}==on]'],
'4':		['Вкл ФИП-Р',	    1,	    0,	None,	                    None,	 None,      None,     '[{@2}{@17}{@19}==on] & [{@20}{@23}{@26}{@27}{@28}{@29}==on]'],
'5':		['ОТКЛ ФИП',	    1,	    0,	None,	                    None,	 None,      None,     '[{@1}{@16}{@18}==off] & [{@2}{@17}{@19}==off] & [{@20}{@23}{@26}{@27}{@28}{@29}==off]'],
'6':		['Вкл МОД-О',	    1,	    0,	None,	                    None,	 None,      None,     '[{@3}{@21}{@30}{@32}==on] & [{@44}{@50}==on] & [{@34}{@35}{@36}{@39}{@40}==on]'],
'7':		['Вкл МОД-Р',	    1,	    0,	None,	                    None,	 None,      None,     '[{@4}{@22}{@31}{@33}==on] & [{@45}{@51}==on] & [{@34}{@35}{@37}{@39}{@40}==on]'],
'8':		['ОТКЛ МОД',	    1,	    0,	None,	                    None,	 None,      None,     '[{@3}{@21}{@30}{@32}==off] & [{@44}{@50}==off] & [{@4}{@22}{@31}{@33}==off] & [{@45}{@51}==off] & [{@34}{@35}{@37}{@39}{@40}==off]'],
'9':		['Вкл УМ-О',	    1,	    0,	None,	                    None,	 None,      None,     '[{@7}{@56}{@58}{@60}==on]'],
'10':		['Вкл УМ-Р',	    1,	    0,	None,         	            None,	 None,      None,     '[{@8}{@57}{@59}{@61}==on]'],
'11':		['ОТКЛ УМ',	        1,	    0,	None,	                    None,	 None,      None,     '[{@7}{@56}{@58}{@60}==off] & [{@8}{@57}{@59}{@61}==off]'],
'12':		['ВКЛ ИМ-ФИП',	    1,	    0,	None,	                    None,	 None,      None,     '[{@20}{@25}==on]'],
'13':		['ОТКЛ ИМ-ФИП',	    1,	    0,	None,	                    None,	 None,      None,     '[{@20}{@25}==off]'],
'14':		['УСТ РЕЖ М1',	    1,	    0,	None,	                    None,	 None,      None,     '[{@35}==1]'],
'15':		['УСТ РЕЖ М2',	    1,	    0,	None,	                    None,	 None,      None,     '[{@35}==2]'],
'16':		['УСТ РЕЖ М3',	    1,	    0,	None,	                    None,	 None,      None,     '[{@35}==3]'],
'17':		['УСТ РЕЖ М4',	    1,	    0,	None,	                    None,	 None,      None,     '[{@35}==4]'],
'18':		['ВКЛ ИМ-МОД',	    1,	    0,	None,	                    None,	 None,      None,     '[{@34}{@38}==on]'],
'19':		['ОТКЛ ИМ-МОД',	    1,	    0,	None,	                    None,	 None,      None,     '[{@34}{@38}==off]'],
'20':		['ШТАТ RS485',	    1,	    0,	None,	                    None,	 None,      None,     None],
'21':		['УСТ RS485-О',	    1,	    0,	None,	                    None,	 None,      None,     None],
'22':		['УСТ RS485-Р',	    1,	    0,	None,	                    None,	 None,      None,     None],
'23':		['ПУСК ШД',	        1,	    0,	None,	                    None,	 None,      None,     None],
'24':		['ОСТАН ШД',	    1,	    0,	None,	                    None,	 None,      None,     '[{@67}{@70}==same#1]'],
'25':		['УСТ ВР ДВИЖ ШД',	1,	    0,	None,	                    None,	 None,      None,     None],
'26':		['УСТ СКОР VS1',	1,	    0,	None,	                    None,	 None,      None,     None],
'27':		['УСТ СКОР VS2',	1,	    0,	None,	                    None,	 None,      None,     None],
}


##############################################################################################
# Main dcit
dictUV = {
    'KPT': {
        'adress': 4,
        'shift_adress': 12,
        'subadress': 0,
        'shift_subadress': 0,
        'nDI': None,
        },                                                                
    'RLCIV': {
        'adress': 10,
        'shift_adress': 12,
        'subadress': 0,             # Subadress 28 или 0
        'shift_subadress': 0,
        'nDI': 1,
        }
}
dictUV = format_main(globals())
print('Msg:: Dcit formatted sucessfully')

if __name__ == '__main__':
    with open(File_Path, 'w', encoding='utf-8') as file:
        json.dump(dictUV, file, ensure_ascii=False, indent=4)
        print('Msg:: Dcit converted to JSON sucessfully')